# TechNest Assignment - 1

In [ ]:
#!pip install ipython-sql

In [ ]:
%load_ext sql

In [9]:
%sql sqlite://

## Q1. Create a transaction table with Transactionid, Customername, Customerlocation as columns.

In [ ]:
%%sql
create table tranx_table (Transactionid int not null,Customername varchar(50),Customerlocation varchar(100));

 * sqlite://
Done.

[]

## Q2.Create table fund (Fundid number, Fundname varchar2(10),amount number)
## Insert into Fund values('One', '200', 100)

In [75]:
%%sql
create table fund (Fundid int,Fundname varchar(10),amount int);
insert into fund values('one','200',100);
select * from fund;

 * sqlite://
Done.
1 rows affected.
Done.

[('one', '200', 100)]

In [74]:
%%sql
drop table fund;

 * sqlite://
Done.

[]

Which of the following statement is/are correct as per above insert statement
1. This will throw error as Fundid is a numeric column and cant store string value. 
2. Data will be inserted successfully
3. This will throw error as fundname is a varchar2 column and cant store numeric data.
4. None of the above.

Answer : 1

Q3.Which of the following statement is/are correct.
a)SQL is case sensitive with data only
b)SQL is a case sensitive language
c)SQL is not a case sensitive language
d)SQL is not case sensitive with reserved/user defined keywords

Answer : (a) and (d)

Q4.Which of the following statement is/are correct.
a) We can create 2 tables with same name in a particular database.
b) Reserved keywords cant be used to create a table.
c) A table cant have more than 50 columns.
d) None

Answer (d)

In [22]:
# Q5. Create a college table with BranchID, Branchname, HODID, HODname, StudentID and Studentname as columns and insert appropriate data accordingly.

In [34]:
%%sql 
create table course (BranchID int not null,Branchname varchar(50),HODID int,StudentId int,Studentname varchar(50));
insert into course values(1,'Sql',5,6,'Aqib');
insert into course values(2,'php',6,7,'Virat');
insert into course values(3,'Node',8,9,'Homer Simpson');

select * from course;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Sql', 5, 6, 'Aqib'),
 (2, 'php', 6, 7, 'Virat'),
 (3, 'Node', 8, 9, 'Homer Simpson')]

In [33]:
%%sql
drop table course;

 * sqlite://
Done.

[]

In [35]:
# Q6.create table sales(custid number,custname varchar2(10),amount number);
# insert into('A',1,'Hundred');

In [52]:
%%sql
create table sales(custid int not null,custname varchar(50),amount int);
insert into sales values('A',1,'Hundred');
select * from sales;

 * sqlite://
Done.
1 rows affected.
Done.

[('A', '1', 'Hundred')]

In [51]:
%%sql
drop table sales;

 * sqlite://
Done.

[]

Which of the following statement is/are correct?
a)Above insert statement will throw error message.
b)Data will be inserted successfully

Answer : (a)

In [41]:
# Q7.create table sales(custid number,custname varchar2(10),amount number);
# insert into(1,B,100);

In [55]:
%%sql
create table sales(custid int not null,custname varchar(50),amount int);
insert into sales values(1,B,100);

 * sqlite://
Done.
(sqlite3.OperationalError) no such column: B
[SQL: insert into sales values(1,B,100);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [58]:
%%sql
drop table sales;

 * sqlite://
Done.

[]

Which of the following statement is/are correct?
a)Above insert statement will throw error message.
b)Data will be inserted successfully

Answer :(a)

In [56]:
# Q8.create table sales(custid number,custname varchar2(10),amount number);
# insert into(1,B,100,2)

In [59]:
%%sql 
create table sales(custid int not null,custname varchar(50),amount int);
insert into sales values(1,B,100,2);
select * from sales;

 * sqlite://
Done.
(sqlite3.OperationalError) no such column: B
[SQL: insert into sales values(1,B,100,2);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [60]:
%%sql
drop table sales;

 * sqlite://
Done.

[]

Which of the following statement is/are correct?
a)Above insert statement will throw error message.
b)Data will be inserted successfully

Answer: (a)

Q9.Sql is case sensitive with reserved and user defined keyword.

a)True
b)False

Answer : (b)

# Q10.Create your introduction table with name,yearsofexp,educationalqualitifcation,location,hobby as columns and insert data accordingly.

In [62]:
%%sql 
create table introduction(name varchar(50),yearsofexp int,educationqualification varchar(50),location varchar(50),hobby varchar(50));
insert into introduction values('Aqib',0,'BCA','Agra','Exploring Computer Science');
insert into introduction values('Virat',10,'MA','Delhi','Exploring Cricket');

select * from introduction;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
Done.

[('Aqib', 0, 'BCA', 'Agra', 'Exploring Computer Science'),
 ('Virat', 10, 'MA', 'Delhi', 'Exploring Cricket')]

In [63]:
%%sql

drop table introduction;

 * sqlite://
Done.

[]

# Q11.Scenario based:
Business analyst of my team needs a table to be created in DB with below specifications/details-
a.Table name:Transaction
b.Columns:Transaction_id,Amount,Location,Paymentmode,Status

create table Transacton(Transactionid varchar2(50),Amt number,Location varchar2(1),status varchar2(100),Modeofpayment varchar2(10));
What is the error with the above create statement.

In [71]:
%%sql 
create table Transaxtion (Transaction_id int,Amount int,Location varchar(1),status varchar(100),modeofpayment varchar(10));
insert into Transaxtion values(1,200,'A','positive','online');
select * from Transaxtion;

 * sqlite://
Done.
1 rows affected.
Done.

[(1, 200, 'A', 'positive', 'online')]

In [70]:
%%sql
drop table transaxtion;

 * sqlite://
Done.

[]